АлогистикТест2/src/Enums/алк_ВидыДокументовПеремещенияЛесопродукции/алк_ВидыДокументовПеремещенияЛесопродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДокументовПеремещенияЛесопродукции</name>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВУтилизацию</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСобственныеНужды</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПереупаковкуСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦЛП</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаЦЛП</name>
  </enumValues>
  <enumValues>
    <name>РеализацияНаСторону</name>
  </enumValues>
  <enumValues>
    <name>РеализацияНаДГ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ВозратС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ВозратС_ЦЛП</name>
  </enumValues>
  <enumValues>
    <name>ВозратС_МЛП</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыСкладскихОпераций/алк_ВидыСкладскихОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыСкладскихОпераций</name>
  <enumValues>
    <name>Пересортица</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНеПакетируемого</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеНеПакетируемого</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаНеПакетируемого</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ТипСклада/алк_ТипСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ТипСклада</name>
  <enumValues>
    <name>СГП</name>
  </enumValues>
  <enumValues>
    <name>Биржа</name>
  </enumValues>
  <enumValues>
    <name>Порт</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>СушильныйКомплекс</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ПеремещениеЛесопродукции/алк_ПеремещениеЛесопродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПеремещениеЛесопродукции</name>
  <comment>Перемещение лесопродукции (круглые ЛМ и пиломатериала штучно) по различным направлениям с указанием участка отправителя</comment>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.алк_ВидыДокументовПеремещенияЛесопродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускатьМинус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_Производство/алк_Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_Производство</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыОтчетаПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Целевая</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/HTTPServices/ExchangeERP/Module.bsl
Функция InventoryTransferAction(Запрос)    
	
	// задача выгружать перемещения за месяц из АЛК и грузить их в один документ перемещения в ЕРП  	
	// из ЕРП приходит запрос с указанием интервала (месяца) загрузки и типа перемещения 
	
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();	
	
	Ответ = ПолучитьДанныеПеремещения(СтрокаJSON);
			
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","application/json");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
		
	Возврат HTTPОтвет;  

КонецФункции
  
Функция ПолучитьДанныеПеремещения(СтрокаJSON)  
	
	ЧтениеJSON = Новый ЧтениеJSON;
	
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON); 
	
	ПоляДат = Новый Массив;
	ПоляДат.Добавить("DateTime");   
	
	ПараметрыЗапроса = ПрочитатьJSON(ЧтениеJSON,, ПоляДат, ФорматДатыJSON.ISO);
	
	//  Формат получаемых данных:
	//
	//"type":"ПередачаНаМЛП", 
	//"DateTime":"2024-12-04T20:00:00",  
	
	Запись = Новый ЗаписьJSON; 
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);  
	Запись.УстановитьСтроку(ПараметрыЗаписиJSON); 
	
	Возврат ПолучитьДанныеПередачаВПроизводство(ПараметрыЗапроса, Запись);
	
	
КонецФункции // ПолучитьДанныеПеремещения()
	
Функция ПолучитьДанныеПередачаВПроизводство(ПараметрыЗапроса, Запись) 
	
	УстановитьПривилегированныйРежим(Истина);	  
	
	Если ПараметрыЗапроса.type = "ПередачаНаМЛП" Тогда  		
		ТекстЗапроса = ПолучитьЗапросПередачаНаМЛП();
	ИначеЕсли ПараметрыЗапроса.type = "ПередачаНаЦЛП" Тогда  		
		ТекстЗапроса = ПолучитьЗапросПередачаНаЦЛП(); 
	ИначеЕсли ПараметрыЗапроса.type = "ПередачаНаЦПШ" Тогда  		
		ТекстЗапроса = ПолучитьЗапросПередачаНаЦПШ(); 
	ИначеЕсли ПараметрыЗапроса.type = "СписаниеШпонаНаФанеру" Тогда  		
		ТекстЗапроса = ПолучитьЗапросПроизводствоФанеры();
	ИначеЕсли ПараметрыЗапроса.type = "СписаниеШпона" Тогда  		
		ТекстЗапроса = ПолучитьЗапросСписаниеШпона(); 
	ИначеЕсли ПараметрыЗапроса.type = "ПередачаНаСГП_Шпон" Тогда  		
		ТекстЗапроса = ПолучитьЗапросПередачаНаСГП_Шпон(); 
	ИначеЕсли ПараметрыЗапроса.type = "ВозвратССГП_Шпон" Тогда  		
		ТекстЗапроса = ПолучитьЗапросВозвратССГП_Шпон(); 
	Иначе	
		ЗаписатьJSON(Запись, "Тип документа к выгрузке не определен!");  		
		Возврат Запись.Закрыть();
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(ПараметрыЗапроса.DateTime) + 8*3600);
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(ПараметрыЗапроса.DateTime) + 8*3600);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Данные = новый Структура("Товары");
	СписокСтрок = новый массив;

	Счетчик = 0;   
	
	НоменклатураШпон 			= Справочники.Номенклатура.НайтиПоКоду("00000000002"); 
	НоменклатураПиломатериал 	= Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
					
		Счетчик = Счетчик + 1;
		
		ДанныеСтроки = Новый Структура("Номер, Номенклатура, Количество, Порода, Сорт, Сечение, Длина, Поверхность, Влажность");
		ДанныеСтроки.номер = Счетчик;
		
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, ВыборкаДетальныеЗаписи);
	    	
		РфпСервер.КонвертироватьТовары(ДанныеСтроки);
		
		СписокСтрок.Добавить(ДанныеСтроки);
		
	КонецЦикла; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Данные.Товары = СписокСтрок;
	
	Запись = Новый ЗаписьJSON; 
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);  
	Запись.УстановитьСтроку(ПараметрыЗаписиJSON); 	
	ЗаписатьJSON(Запись, Данные);

	Возврат Запись.Закрыть();

КонецФункции // ПолучитьДанныеПередачаНаМЛП()

	
Функция ПолучитьЗапросПередачаНаМЛП() 
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОбороты.КоличествоПриход) КАК Количество,
		|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.Наименование КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование КАК Влажность
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			СтруктурнаяЕдиница.Код = ""ПБ-000060""
		|				И Номенклатура.Код = ""ПБ-00000002"") КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер,
		|	алк_ПараметрыХарактеристик.Порода.Наименование,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование,
		|	алк_ПараметрыХарактеристик.Длина.Наименование,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";

    Возврат ЗапросТекст;
	

КонецФункции // ПолучитьЗапросПередачаНаМЛП()

Функция ПолучитьЗапросПередачаНаЦЛП() 
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОбороты.КоличествоПриход) КАК Количество,
		|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.Наименование КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование КАК Влажность
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			СтруктурнаяЕдиница.Код = ""ПБ-000003""
		|				И Номенклатура.Код = ""ПБ-00000002"") КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	ВЫРАЗИТЬ(алк_ОстаткиЗапасовОбороты.Регистратор КАК Документ.алк_ПеремещениеЛесопродукции).ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаЦЛП)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер,
		|	алк_ПараметрыХарактеристик.Порода.Наименование,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование,
		|	алк_ПараметрыХарактеристик.Длина.Наименование,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";

    Возврат ЗапросТекст;
	

КонецФункции // ПолучитьЗапросПередачаНаЦЛП()

Функция ПолучитьЗапросПередачаНаЦПШ() 
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОбороты.КоличествоПриход) КАК Количество,
		|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.Наименование КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование КАК Влажность
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			СтруктурнаяЕдиница.Код = ""ПБ-000001""
		|				И Номенклатура.Код = ""ПБ-00000002"") КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	ВЫРАЗИТЬ(алк_ОстаткиЗапасовОбороты.Регистратор КАК Документ.алк_ПеремещениеЛесопродукции).ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаЦПШ)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер,
		|	алк_ПараметрыХарактеристик.Порода.Наименование,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование,
		|	алк_ПараметрыХарактеристик.Длина.Наименование,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";

    Возврат ЗапросТекст;
	

КонецФункции // ПолучитьЗапросПередачаНаЦПШ()

Функция ПолучитьЗапросПроизводствоФанеры() 
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОбороты.СерийныйНомер) КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОбороты.КоличествоРасход) КАК Количество,
		|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.Наименование КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование КАК Влажность
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			СтруктурнаяЕдиница.Код = ""ПБ-000064""
		|				И Номенклатура.Код = ""00000000002"") КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	ВЫРАЗИТЬ(алк_ОстаткиЗапасовОбороты.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ПараметрыХарактеристик.Порода.Наименование,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование,
		|	алк_ПараметрыХарактеристик.Длина.Наименование,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";

    Возврат ЗапросТекст;
	

КонецФункции // ПолучитьЗапросПроизводствоФанеры()

Функция ПолучитьЗапросСписаниеШпона() 
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОбороты.СерийныйНомер) КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОбороты.КоличествоРасход) КАК Количество,
		|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.Наименование КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование КАК Влажность
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			СтруктурнаяЕдиница.Код = ""ПБ-000064""
		|				И Номенклатура.Код = ""00000000002"") КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	ВЫРАЗИТЬ(алк_ОстаткиЗапасовОбороты.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ПараметрыХарактеристик.Порода.Наименование,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование,
		|	алк_ПараметрыХарактеристик.Длина.Наименование,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";

    Возврат ЗапросТекст;
	

КонецФункции // ПолучитьЗапросПроизводствоФанеры()

Функция ПолучитьЗапросПередачаНаСГП_Шпон() 
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОбороты.СерийныйНомер) КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОбороты.КоличествоРасход) КАК Количество,
		|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.Наименование КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование КАК Влажность
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			СтруктурнаяЕдиница.Код = ""ПБ-000064""
		|				И Номенклатура.Код = ""00000000002"") КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	ВЫРАЗИТЬ(алк_ОстаткиЗапасовОбороты.Регистратор КАК Документ.алк_Перемещение).СкладПолучатель.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ПараметрыХарактеристик.Порода.Наименование,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование,
		|	алк_ПараметрыХарактеристик.Длина.Наименование,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";

    Возврат ЗапросТекст;
	

КонецФункции // ПолучитьЗапросПередачаНаСГП_Шпон()


Функция ПолучитьЗапросВозвратССГП_Шпон() 
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОбороты.СерийныйНомер) КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОбороты.КоличествоПриход) КАК Количество,
		|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.Наименование КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование КАК Влажность
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			СтруктурнаяЕдиница.Код = ""ПБ-000064""
		|				И Номенклатура.Код = ""00000000002"") КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	ВЫРАЗИТЬ(алк_ОстаткиЗапасовОбороты.Регистратор КАК Документ.алк_Перемещение).СкладОтправитель.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ПараметрыХарактеристик.Порода.Наименование,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование,
		|	алк_ПараметрыХарактеристик.Длина.Наименование,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";

    Возврат ЗапросТекст;
	

КонецФункции // ПолучитьЗапросПередачаНаСГП_Шпон()
